<?php
    include('header.php');


    //заготовки текста для отрисовки
    $text[3] = "<p>Ансамбль «Выше радуги» Муниципальной детской вокально-эстрадной студии «Радуга» -это сплоченный и творческий коллектив.</p>
                <p>Обаятельные и энергичные, креативные и веселые, талантливые и трудолюбивые, яркие и позитивные, зажигательные и скромные, с прекрасными вокальными данными, большим творческим потенциалом, яркой индивидуальностью и харизмой. Ансамбль является многократным победителем, лауреатом и неоднократным обладателем Гран- при Международных конкурсов и фестивалей.</p>
                <p>Ребята считают, что трудолюбие и полная отдача - главные качества успешного коллектива. Все участники ансамбля обладают прекрасными вокальными данными. В ансамбле царит здоровая творческая конкуренция и желание проявить себя. Коллектив и его солисты являются участниками всех городских и республиканских творческих, праздничных мероприятий. Активно принимают участие в постановке мюзиклов и театрализованных представлений.</p>
                <p>В репертуаре ансамбля «Выше радуги» большое количество многоголосных ансамблевых и сольных композиций на русском, английском, испанском, итальянском, адыгском, а также на украинском языках.  Каждое произведение в исполнении ребят - это отдельный мини-спектакль со своими яркими красками, переживаниями, искренностью, чистотой и любовью к зрителю.</p>
                <p>Ребята всегда находятся в потоке творчества и невероятно счастливы, что 2020 и 2021 году стали лауреатами Международного телевизионного фестиваля «Песенка года» (ВДЦ «Орленок»), «Звездочки Адыгеи», «Новые огни» (г.Краснодар), Открытого конкурса «Мастер мюзикла» (г.Москва-2022), Гран-при городского конкурса «Жемчужины Майкопа» (2022), «Театральный вернисаж» (2022), Гран-при Международных вокальных конкурсов «Золотые голоса» (г.Ростов-на-Дону) ,«Энергия звезд» (г.Краснодар), «Мы вместе» (г.Волгоград), а также финалистами и победителями юбилейной музыкальной премии Musicstarkids-2021 в г.Челябинск и спели с симфо-джаз оркестром.</p>
                <p><i>«Талантливые дети, колоссальная работа, качественный репертуар, оригинальные постановки, яркие костюмы...»</i> - это все отмечают члены жюри.</p>";

    $text[4] = "<p>Вокально-эстрадный ансамбль «Радуга» - это средний состав Детской вокально-эстрадной студии «Радуга». В состав ансамбля входят 12 человек, возраст которых от 8 до 11 лет.</p>
                <p>Вокально-эстрадный ансамбль «Радуга» и его солисты являются участниками городских и республиканских, праздничных мероприятий, посвященных Дню Города, Дню знаний, Дню учителя, Дню матери,  Дню независимости России, Дню защитника Отечества, Дню республики, Дню Победы и многих других.</p>
                <p>Активно принимают участие в постановке мюзиклов, театрализованных представлений, участвуют и побеждают в различных городских, республиканских, всероссийских и международных конкурсах и фестиваля.</p>
                <p>Творческую деятельность образцового вокально-эстрадного ансамбля «Радуга» за истекший период можно считать плодотворной. Ансамбль принимал участие в фестивалях и конкурсах различного уровня и завоевывал высшие награды.</p>
                <p>В 2019 году ансамбль стал Лауреатом Международного Фестиваля-Конкурса Детского и Юношеского Творчества «Балтийское созвездие» (г. Краснодар, Россия) и Лауреатом Международного Фестиваля-Конкурса «Имена России» (г.Ростов на Дону).</p>
                <p>В 2020 г. ансамбль стал Лауреатом Iстепени Международного фестиваля-конкурса «Детство цвета апельсин» (г.Краснодар).</p>
                <p>В 2021 году ансамбль стал Лауреатом Международного Фестиваля-Конкурса «Стать звездой» (г. Краснодар) и лауреатом Городского конкурса «Жемчужины Майкопа» (г. Майкоп).</p>
                <p>В 2022 году лауреат международных конкурсов «Белая ворона» и «Мы вместе» (г. Волгоград).</p>";

    $text[5] = "<p>Ансамбль «12 кадров» Муниципальной детской вокально-эстрадной студии «Радуга»-это 12 ярких, талантливых, музыкальных,веселых и трудолюбивых ребят. В ансамбле царит дружная атмосфера и здоровая творческая конкуренция. Ребята принимают участие в постановке мюзиклов и театрализованных представлений.</p>
                <p>В репертуаре ансамбля «12 кадров» большое количество ансамблевых и сольных композиций на русском и английскомязыках. Концертное выступление - ответственный момент в жизни коллектива, конечный результат проделанной репетиционной работы, выраженный в исполнении вокальных номеров перед публикой.</p>
                <p>Ансамбль является многократным победителем, лауреатом и обладателем Гран – приГородских, Международных и Всероссийских конкурсов и фестивалей:</p>
                <p>Лауреат Международного телевизионного фестиваля «Песенка года» (ВДЦ «Орленок» 2021), Международного конкурса «Звезда эстрады» (г.Москва-2021),«Звездочки Адыгеи», Международного конкурса «Новые огни» (г.Краснодар-2021), Международного конкурса «Мы вместе» (г.Волгоград-2022), Международного вокального конкурса «Золотые голоса» (г.Ростов-на-Дону) , «Энергия звезд» (г.Краснодар), Всероссийского конкурса «Невские звезды», Гран-при городского конкурса «Жемчужины Майкопа» (2021), «Театральный вернисаж», Гран-при Межрегионального фестиваля детских театральных коллективов и многих других.</p>";

    $text[6] = "<p>В настоящее время в коллективе занимаются 14 человек, возраст которых 8 от до 11 лет.</p>
                <p>Вокально-эстрадный ансамбль «Star kids» участвовал во всех праздничных мероприятиях и концертах, проводившихся в республике и городе. Это концерты, посвященные Дню Города, Дню знаний, Дню учителя, Дню матери, Дню независимости России, Дню защитника Отечества, Дню Победы, Дню флага и тд.</p>
                <p>Ансамбль принимал участие в фестивалях и конкурсах различного уровня и завоевывал высшие награды.</p>
                <p>В 2019 году ансамбль стал Лауреатом Международного Фестиваля-Конкурса Детского и Юношеского Творчества «Балтийское созвездие» (г. Краснодар, Россия) и Лауреатом Международного Фестиваля-Конкурса «Новые имена» (г. Краснодар).</p>
                <p>В 2020 г. ансамбль стал Лауреатом Iстепени Международного фестиваля-конкурса «Детство цвета апельсин» (г.Краснодар).</p>
                <p>В 2021 году ансамбль стал обладателем ГРАН-ПРИ Международного Фестиваля-Конкурса «Энергия звезд» (г. Краснодар) и «Золотые голоса» (г. Ростов на Дону).</p>
                <p>Лауреат Городского конкурса «Жемчужины Майкопа» (г. Майкоп).</p>
                <p>В 2022 г. лауреат 1 степени международных конкурсов «Новые огни», «Белая ворона», «Мы вместе» (г. Волгоград).</p>";
    
    $text[7] = "<p>Вокально эстрадный ансамбль «Звонкий дождь» состоит из 12 человек, возраст которых 7-8 лет. 
                <p>За небольшой период ансамбль успел завоевать симпатии зрителей в нашем городе и за его пределами. Вокал, хореография, актерское мастерство, выездные конкурсы и концерты - вот что успели освоить маленькие артисты. Коллектив участвует в настоящих профессиональных клипах.</p>";
    
    $text[8] = "<p>Вокально-эстрадный ансамбль «Капельки» — cамые юные воспитанники Детской вокально-эстрадной студии «Радуга».</p>
                <p>В состав ансамбля входит 12 человек, возраст которых 5-6 лет. Каждое выступление для ребят-это новые эмоции и новый опыт.</p>";


    $id = '';
    $group = $_GET['group'];
    if ($group != null) {
        switch ($group) {
            case "Vyshe_radugi":
                $id = 3;
            break;
            case "Raduga":
                $id = 4;
            break;
            case "12_kadrov":
                $id = 5;
            break;
            case "StarKids":
                $id = 6;
            break;
            case "Zvonki_dozhd'":
                $id = 7;
            break;
            case "Kapel'ki":
                $id = 8;
            break;
        }
        unset($result_imgs);
        unset($result_diploms);
        unset($myrow_imgs);
        unset($myrow_diploms);
        $sql = "SELECT `image_path`,`image_format` FROM `groups_content` WHERE ID_group = '$id' AND type_content = 'image'";
        $result_imgs = mysqli_query($db, $sql);
        $sql = "SELECT `image_path`,`image_format` FROM `groups_content` WHERE ID_group = '$id' AND type_content = 'diplom'";
        $result_diploms = mysqli_query($db, $sql);

        //кнопкаподачи заявки на вступление
        if ($_SESSION['ID_group'] == '1') {
            echo "<div class='btn-request'><a href='requests.php?id=".$id."'>Записать ребёнка в ансамбль!</a></div>";
        }
        elseif ($_SESSION['ID_group'] == '2') {
            echo "<div class='btn-request'><a href='requests.php?id=".$id."'>Подать заявку на вступление в ансамбль!</a></div>";
        }
        elseif (!isset($_SESSION['ID_group'])) {
            echo "<div class='btn-request'><a href='login.php?group=".$id."'>Хотите стать частью нашего дружного коллектива?<br>Тогда зарегистрируйтесь и подайте заявкуна вступление!</a></div>"; 
        }

        //отрисовка собранных данных
        echo $text[$id];
        echo "<div class='image'>";
            while ($myrow_imgs = mysqli_fetch_array($result_imgs)) {
                echo "<img src=\"".$myrow_imgs['image_path'].".".$myrow_imgs['image_format']."\">";
            }
        echo "</div>";
        if ($myrow_diploms = mysqli_fetch_array($result_diploms)) {
            echo "<div class='diplom'><h2>Наши достижения!</h2>";
                echo "<img src=\"".$myrow_diploms['image_path'].".".$myrow_diploms['image_format']."\">";
                while ($myrow_diploms = mysqli_fetch_array($result_diploms)) {
                    echo "<img src=\"".$myrow_diploms['image_path'].".".$myrow_diploms['image_format']."\">";
                }
            echo "</div>";
        }
    }
    else {
        echo "<div><h3>Страница не найдена</h3>
        <p>Страница устарела, была удалена или не существовала вовсе</p></div>";
    }
?>







