<?php
    include("header.php");

    // назначение переменных для удобства редактирования
    $main_text = "
    <h1>Муниципальная детская вокально-эстрадная студия «РАДУГА»</h1>
    <p>Детская вокально-эстрадная студия «Радуга» была создана в сентябре 2004 года на базе Центра развития творчества детей и юношества г. Майкопа.</p>
    <p>Создателем и бессменным руководителем коллектива является Елена Владимировна Щербак, Заслуженный работник культуры Республики Адыгеи, Почётный работник общего образования Российской Федерации.</p>
    <p>«Радуга» - одно из самых известных и популярных в городе и республике творческих объединений.</p>
    <div class='imgsBlock'> 
        <img src=\"Content/Main_page/img_1.1.jpg\">
        <img src=\"Content/Main_page/img_1.2.jpg\">
        <img src=\"Content/Main_page/img_1.3.jpg\">
    </div>
    <p>За 18 лет ансамбль из 24 человек вырос в большой сплоченный коллектив с прекрасными традициями и огромным потенциалом - настоящую школу детского эстрадного творчества.</p>
    <p>В настоящее время в составе детской вокально-эстрадной студии «Радуга» обучаются более 70 юных артистов в возрасте от 5 до 16 лет - это шесть вокальных ансамблей:</p>
    <ul>
        <li>«Капельки» (5-6 лет)</li>
        <li>«Звонкий дождь» (7-8 лет)</li>
        <li>«StarKids» (9-10 лет)</li>
        <li>«Радуга» (10-11 лет)</li>
        <li>«12 кадров» (11-13 лет)</li>
        <li>«Выше Радуги» (14-17лет)</li>
    </ul>
    <p>В детской вокально-эстрадной студии «Радуга» уже 18 лет профессионально раскрывают настоящие таланты детей и подростков по трем основным направлениям: эстрадный вокал, современная хореография и актерское мастерство.</p>
    <p>Практикуемый в «Радуге» подход к обучению позволяет проявить себя каждому ребенку без исключения, так как отличительной  особенностью работы коллектива является не только создание вокальных ансамблей, но и индивидуальное развитие каждого воспитанника в качестве солиста.</p>
    <div class='imgsBlock'> 
        <img src=\"Content/Main_page/img_2.1.jpg\">
        <img src=\"Content/Main_page/img_2.2.jpg\">
        <img src=\"Content/Main_page/img_2.3.jpg\">
    </div>
    <p>Полет мелодии, сила, красота и многогранность звучания песен — в этом жизнь наших радужных артистов. 
    <p>Занятия в «Радуге» дают возможность воспитанникам удовлетворить свой интерес, проявить способности, раскрыть свой внутренний мир, помочь сформировать положительную самооценку, эстетическую культуру.</p>
    <p>Большое значение имеют для \"Радуги\" концертные выступления, являющиеся неотъемлемой частью исполнительской деятельности. Они активизируют, стимулируют работу ребят в коллективе, позволяют проявлять полученные знания, умения и навыки, способствуют творческому росту вокальных ансамблей и солистов. Ежегодно коллектив дает сольные концерты, ставит мюзиклы.</p>
    <p>Каждый выход на сцену юных вокалистов – это маленький спектакль, раскрывающий детскую непосредственность, одарённость и талант.</p>
    <p>Красивые костюмы, хореография, фантастическая динамика, а также великолепный сольный и ансамблевый вокал – всё это обеспечивает тёплый приём и восхищение публики.</p>
    <div class='imgsBlock'> 
        <img src=\"Content/Main_page/img_3.1.jpg\">
        <img src=\"Content/Main_page/img_3.2.jpg\">
        <img src=\"Content/Main_page/img_3.3.jpg\">
    </div>
    <p>\"Радуга\" украшает своими выступлениями все городские и республиканские праздники, а сольные концерты, мюзиклы и театральные постановки коллектива неизменно собирают полные залы восторженных зрителей.</p>
    <p>Каждый номер - это маленькое шоу, где присутствует и игровое начало, и замечательные голоса участников, и, конечно, прекрасная музыка. В репертуаре ансамбля - эстрадные хиты, которые в исполнении ребят часто приобретают новое, неожиданное звучание, и популярные современные композиции, исполняемые на высоком уровне. Участники ансамбля действительно любят, а, главное, умеют петь!</p>
    <p>Воспитанники «Радуги» являются участниками всех городских и республиканских творческих, праздничных мероприятий, посвященных Дню города, Дню знаний, Дню учителя, Дню матери, Дню России, Дню защитника Отечества, Дню Республики Адыгея, Дню Победы и многих других.</p>
    <p>Активная концертная деятельность позволяет коллективу пропагандировать свое творчество. Высокий художественно-эстетический уровень выступлений, исполнительское мастерство, творческий потенциал и артистизм юных вокалистов сделали коллектив известным не только в городе и республике, но и за ее пределами.</p>
    <p>Театральное искусство помогает ребенку не только развить свои таланты, но и расширять кругозор. С каждым годом увеличивается репертуарная копилка мюзиклов и театральных постановок: «Волк и семеро козлят», «Муха Цокотуха», «Бременские музыканты», «Золотой ключик, или Приключения Буратино», «Красная Шапочка», «Царевна-лягушка», «Сказки Пушкина»  и многие другие.</p>
    <p>Искусству мюзикла обучают профессиональные педагоги, подходя индивидуально к каждому ученику.</p>
    <p>Солисты и ансамбли детской вокально-эстрадной студии «Радуга» являются лауреатами и обладателями Гран-при городских, республиканских, всероссийских и международных конкурсов.</p>
    <p>В коллективе царит творческая конкуренция и желание проявить себя.</p>
    <p>Эмоции победы – всегда самые сильные, трогательные и незабываемые.</p>
    <p>В детской вокально-эстрадной студии «Радуга» налажен продуктивный творческий процесс.</p>
    <p>Занятия ведут опытные педагоги, которые используют современные  методики, позволяющие овладеть навыками исполнительского мастерства.</p>
    <p>Особое место в деятельности студии занимает формирование эстетической культуры, являющейся одним из стержневых, базисных свойств личности.</p>
    <p>Работа с детьми – РАДОСТЬ! В каждом взгляде, в каждом слове, в каждой ноте!</p>
    <div class='imgsBlock'> 
        <img src=\"Content/Main_page/img_4.1.jpg\">
        <img src=\"Content/Main_page/img_4.2.jpg\">
        <img src=\"Content/Main_page/img_4.3.jpg\">
    </div>
    <p>Атмосфера, творческие проекты и концертные программы и первые творческие шаги на сцене учат ребят разговаривать с другими людьми без стеснения, раскрепощают и дарят веру в себя.</p>
    <p>Вот как бывает: сначала родители приводят в \"Радугу\" маленьких и любопытных малышей, а уже через несколько лет они становятся уверенными в себе юными артистами, которые покоряют сцены международных конкурсов! А за этими двумя запоминающимися моментами — творческая, неповторимая, веселая и сложная работа преподавателей, которые обожают свое дело и самих детей.</p>
    <p>Во всех спектаклях, отчетных концертах, в реализации самых невообразимых идей родители учеников — это главные помощники и основной источник креативных задумок!</p>
    <p>И тогда на сцене происходит настоящая магия: кажется, что между детьми-артистами на сцене и родителями в зрительном зале натянуты крепкие, прочные нити.</p>
    <p>Полет мелодии, сила, красота и многогранность звучания песен — в этом жизнь наших радужных артистов. Давайте петь и развивать таланты вместе!</p>
    <p>С момента создания детской вокально-эстрадной студии «Радуга» накопилось очень много ярких номеров, как ансамблевых, так и сольных, полюбившихся зрителям.</p>
    <p>Искристые, открытые, творческие и неповторимые воспитанники детской вокально-эстрадной студии «Радуга» - это настоящее созвездие юных талантливых артистов!</p>
    <p>За 18 лет было создано более 150 вокально-хореографических номеров, различных по характеру и стилю, поставлено 10 мюзиклов, заработано более 200 наград в городских, республиканских, всероссийских и международных конкурсах и фестивалях.</p>
    <p>Показателем высокого художественного уровня творческой и исполнительской деятельности детской вокально-эстрадной студии «Радуга» является присвоение звания «Народный» вокально-эстрадному ансамблю «Выше радуги» и звания «Образцовый» вокально-эстрадному ансамблю «Радуга».</p>
    <p>Главная цель - максимально раскрыть творческие способности ребенка и подготовить его к любой творческой деятельности, выбранной им в будущем.</p>
    <p>Увлекательные занятия, интересные проекты, замечательные педагоги и прекрасные друзья - все это «РАДУГА»!</p>
    <p>Желаем получать от жизни огромное удовольствие, сиять на сцене, добиваться поставленных целей!</p>
    <div class='imgsBlock'> 
        <img src=\"Content/Main_page/img_5.1.jpg\">
        <img src=\"Content/Main_page/img_5.2.jpg\">
        <img src=\"Content/Main_page/img_5.3.jpg\">
    </div>
    ";


/*
    // панель редактирования
    if($_SESSION['ID_group'] == -1 || ($_SESSION['ID_group'] == 0 && !empty($_SESSION))) {
        echo "
        <form action=\"./edit_page.php\" method=\"post\">
            <button type=\"submit\" name=\"submit\">
                edit_page
            </button>";
            $_POST["text"] = $main_text;
        echo "</form>";
    }    
*/
    echo "$main_text";

?>


</div>
</body>
</html>